TexasInstruments/motor-control-sdk/examples/tidm_02018_universal_motorcontrol/universal_motorcontrol/src_board/AM263_3phGaN_3SC.syscfg
section14.$name                   = "UMC_TCMB";
section14.load_memory             = "R5F_TCMB";
section14.output_section.create(7);
section14.output_section[0].$name = ".tcm_data";
section14.output_section[1].$name = "hal_data";
section14.output_section[2].$name = "user_data";
section14.output_section[3].$name = "foc_data";
section14.output_section[4].$name = "motor_data";
section14.output_section[5].$name = "sys_data";
section14.output_section[6].$name = ".sfradata";

section15.$name                   = "UMC_OCRAM";
section15.load_memory             = "OCRAM";
section15.output_section.create(2);
section15.output_section[0].$name = ".trigData";
section15.output_section[1].$name = ".datalog_data";

epwm_xbar1.$name      = "MTR1_IS_TRIP_CMPSS";
epwm_xbar1.instance   = "EPWM_XBAR_6";
epwm_xbar1.xbarOutput = ["CMPSSA3_CTRIPH","CMPSSA3_CTRIPL","CMPSSA5_CTRIPH","CMPSSA5_CTRIPL","CMPSSA7_CTRIPH","CMPSSA7_CTRIPL"];

input_xbar1.$name      = "CONFIG_CAP_U_XBAR";
input_xbar1.instance   = "INPUT_XBAR_4";
input_xbar1.xbarOutput = "GPIO137";

input_xbar2.$name      = "CONFIG_CAP_V_XBAR";
input_xbar2.instance   = "INPUT_XBAR_5";
input_xbar2.xbarOutput = "GPIO135";

input_xbar3.$name      = "CONFIG_CAP_W_XBAR";
input_xbar3.instance   = "INPUT_XBAR_6";
input_xbar3.xbarOutput = "GPIO134";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["ADC0_INT1"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution  = "EPWM3_A";
epwm1.EPWM.B.$suggestSolution  = "EPWM3_B";
epwm2.EPWM.A.$suggestSolution  = "EPWM13_A";
epwm2.EPWM.B.$suggestSolution  = "EPWM13_B";
epwm3.EPWM.A.$suggestSolution  = "EPWM9_A";
epwm3.EPWM.B.$suggestSolution  = "EPWM9_B";
mcan1.MCAN.$suggestSolution    = "MCAN0";
mcan1.MCAN.RX.$suggestSolution = "MCAN0_RX";
mcan1.MCAN.TX.$suggestSolution = "MCAN0_TX";
